This change has been applied:

```console
$ aws-vault exec hyperbola-prod-admin -- terraform apply
Opening the SSO authorization page in your default browser (use Ctrl-C to abort)
https://device.sso.us-west-2.amazonaws.com/?user_code=NNDV-BTTP
Acquiring state lock. This may take a few moments...
module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::473124112471:oidc-provider/token.actions.githubusercontent.com]
aws_route53_zone.this: Refreshing state... [id=Z9AG7AEGFABVK]
aws_iam_account_password_policy.this: Refreshing state... [id=iam-account-password-policy]
module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only: Refreshing state... [id=arn:aws:iam::473124112471:policy/github-actions-hyperbola-project-infrastructure-tf-state-ro]
module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role]
module.hyperbola_email_dns.aws_route53_record.dkim: Refreshing state... [id=Z9AG7AEGFABVK_google._domainkey_TXT]
module.hyperbola_email_dns.aws_route53_record.txt: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_TXT]
aws_route53_record.www_ipv4: Refreshing state... [id=Z9AG7AEGFABVK_www_A]
aws_route53_record.github_challenge_hyperbola: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola_TXT]
module.hyperbola_email_dns.aws_route53_record.mx: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_MX]
aws_route53_record.github_challenge_hyperbola_www: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola.www_TXT]
aws_route53_record.apex_ipv4: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_A]
module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role-20211217054238941500000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github has changed
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::473124112471:oidc-provider/token.actions.githubusercontent.com"
      + tags            = {}
        # (5 unchanged attributes hidden)
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only has changed
  ~ resource "aws_iam_policy" "terraform_state_read_only" {
        id        = "arn:aws:iam::473124112471:policy/github-actions-hyperbola-project-infrastructure-tf-state-ro"
        name      = "github-actions-hyperbola-project-infrastructure-tf-state-ro"
      + tags      = {}
        # (5 unchanged attributes hidden)
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role has changed
  ~ resource "aws_iam_role" "github_role" {
        id                    = "github-actions-hyperbola-project-infrastructure-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::473124112471:policy/github-actions-hyperbola-project-infrastructure-tf-state-ro",
        ]
        name                  = "github-actions-hyperbola-project-infrastructure-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.apex_ipv6 will be created
  + resource "aws_route53_record" "apex_ipv6" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hyperbo.la"
      + records         = [
          + "2606:50c0:8000::153",
          + "2606:50c0:8001::153",
          + "2606:50c0:8002::153",
          + "2606:50c0:8003::153",
        ]
      + ttl             = 300
      + type            = "AAAA"
      + zone_id         = "Z9AG7AEGFABVK"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.apex_ipv6: Creating...
aws_route53_record.apex_ipv6: Still creating... [10s elapsed]
aws_route53_record.apex_ipv6: Still creating... [20s elapsed]
aws_route53_record.apex_ipv6: Still creating... [30s elapsed]
aws_route53_record.apex_ipv6: Creation complete after 39s [id=Z9AG7AEGFABVK_hyperbo.la_AAAA]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

github_actions_project_infrastructure_assume_role_arn = "arn:aws:iam::473124112471:role/github-actions-hyperbola-project-infrastructure-role"
hyperbola_zone_id = "Z9AG7AEGFABVK"
$ aws-vault exec hyperbola-prod-admin -- terraform apply
Acquiring state lock. This may take a few moments...
module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::473124112471:oidc-provider/token.actions.githubusercontent.com]
aws_route53_zone.this: Refreshing state... [id=Z9AG7AEGFABVK]
aws_route53_record.www_ipv4: Refreshing state... [id=Z9AG7AEGFABVK_www_A]
aws_iam_account_password_policy.this: Refreshing state... [id=iam-account-password-policy]
module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only: Refreshing state... [id=arn:aws:iam::473124112471:policy/github-actions-hyperbola-project-infrastructure-tf-state-ro]
module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role]
aws_route53_record.github_challenge_hyperbola_www: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola.www_TXT]
aws_route53_record.apex_ipv6: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_AAAA]
module.hyperbola_email_dns.aws_route53_record.txt: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_TXT]
aws_route53_record.apex_ipv4: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_A]
module.hyperbola_email_dns.aws_route53_record.dkim: Refreshing state... [id=Z9AG7AEGFABVK_google._domainkey_TXT]
aws_route53_record.github_challenge_hyperbola: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola_TXT]
module.hyperbola_email_dns.aws_route53_record.mx: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_MX]
module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role-20211217054238941500000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_route53_record.apex_ipv6 has changed
  ~ resource "aws_route53_record" "apex_ipv6" {
        id      = "Z9AG7AEGFABVK_hyperbo.la_AAAA"
        name    = "hyperbo.la"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.www_cname will be created
  + resource "aws_route53_record" "www_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "hyperbola.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z9AG7AEGFABVK"
    }

  # aws_route53_record.www_ipv4 will be destroyed
  # (because aws_route53_record.www_ipv4 is not in configuration)
  - resource "aws_route53_record" "www_ipv4" {
      - fqdn    = "www.hyperbo.la" -> null
      - id      = "Z9AG7AEGFABVK_www_A" -> null
      - name    = "www" -> null
      - records = [
          - "185.199.108.153",
          - "185.199.109.153",
          - "185.199.110.153",
          - "185.199.111.153",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z9AG7AEGFABVK" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.www_ipv4: Destroying... [id=Z9AG7AEGFABVK_www_A]
aws_route53_record.www_cname: Creating...
aws_route53_record.www_ipv4: Still destroying... [id=Z9AG7AEGFABVK_www_A, 10s elapsed]
aws_route53_record.www_ipv4: Still destroying... [id=Z9AG7AEGFABVK_www_A, 20s elapsed]
aws_route53_record.www_ipv4: Still destroying... [id=Z9AG7AEGFABVK_www_A, 30s elapsed]
aws_route53_record.www_ipv4: Still destroying... [id=Z9AG7AEGFABVK_www_A, 40s elapsed]
aws_route53_record.www_ipv4: Destruction complete after 40s
╷
│ Error: [ERR]: Error building changeset: InvalidChangeBatch: [RRSet of type CNAME with DNS name www.hyperbo.la. is not permitted as it conflicts with other records with the same DNS name in zone hyperbo.la.]
│ 	status code: 400, request id: 5fc4b6c0-d944-4102-a681-30ed4393362e
│
│   with aws_route53_record.www_cname,
│   on dns.tf line 52, in resource "aws_route53_record" "www_cname":
│   52: resource "aws_route53_record" "www_cname" {
│
╵
Releasing state lock. This may take a few moments...
$ aws-vault exec hyperbola-prod-admin -- terraform apply
Acquiring state lock. This may take a few moments...
module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::473124112471:oidc-provider/token.actions.githubusercontent.com]
aws_route53_zone.this: Refreshing state... [id=Z9AG7AEGFABVK]
aws_iam_account_password_policy.this: Refreshing state... [id=iam-account-password-policy]
module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only: Refreshing state... [id=arn:aws:iam::473124112471:policy/github-actions-hyperbola-project-infrastructure-tf-state-ro]
module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role]
aws_route53_record.github_challenge_hyperbola: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola_TXT]
aws_route53_record.apex_ipv6: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_AAAA]
aws_route53_record.apex_ipv4: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_A]
aws_route53_record.github_challenge_hyperbola_www: Refreshing state... [id=Z9AG7AEGFABVK__github-challenge-hyperbola.www_TXT]
module.hyperbola_email_dns.aws_route53_record.mx: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_MX]
module.hyperbola_email_dns.aws_route53_record.txt: Refreshing state... [id=Z9AG7AEGFABVK_hyperbo.la_TXT]
module.hyperbola_email_dns.aws_route53_record.dkim: Refreshing state... [id=Z9AG7AEGFABVK_google._domainkey_TXT]
module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only: Refreshing state... [id=github-actions-hyperbola-project-infrastructure-role-20211217054238941500000001]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.www_cname will be created
  + resource "aws_route53_record" "www_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "hyperbola.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z9AG7AEGFABVK"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.www_cname: Creating...
aws_route53_record.www_cname: Still creating... [10s elapsed]
aws_route53_record.www_cname: Still creating... [20s elapsed]
aws_route53_record.www_cname: Still creating... [30s elapsed]
aws_route53_record.www_cname: Creation complete after 39s [id=Z9AG7AEGFABVK_www_CNAME]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

github_actions_project_infrastructure_assume_role_arn = "arn:aws:iam::473124112471:role/github-actions-hyperbola-project-infrastructure-role"
hyperbola_zone_id = "Z9AG7AEGFABVK"
```